{"skills": [{"skilldesc": "Abaddon releases a coil of deathly mist that can damage an enemy unit or heal a friendly unit at the cost of some of Abaddon's health.", "skillname": "Mist Coil", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/abaddon_death_coil_hp1.png"}, {"skilldesc": "Summons dark energies around an ally unit, creating a shield that absorbs a set amount of damage before expiring. When the shield is destroyed it will burst and deal damage equal to the amount it could absorb to an area around it. Removes certain types of negative buffs and stuns on cast.", "skillname": "Aphotic Shield", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/abaddon_aphotic_shield_hp1.png"}, {"skilldesc": "Abaddon strikes an enemy with chilling curse on each attack, causing all units who attack the slowed enemy to gain increased movement speed, along with faster attack speed, for a limited time.", "skillname": "Curse of Avernus", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/abaddon_frostmourne_hp1.png"}, {"skilldesc": "When activated, all damage dealt to you will heal instead of harm. Most negative buffs will also be removed. If the ability is not on cooldown, it will passively activate if your hitpoints drop below 400.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Borrowed Time", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/abaddon_borrowed_time_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/abaddon_full.png", "name": "Abaddon", "desc": "The Font of Avernus is the source of a family's strength, a crack in primal stones from which vapors of prophetic power have issued for generations. Each newborn of the cavernous House Avernus is bathed in the black mist, and by this baptism they are given an innate connection to the mystic energies of the land. They grow up believing themselves fierce protectors of their lineal traditions, the customs of the realm--but what they really are protecting is the Font itself. And the motives of the mist are unclear.   When the infant Abaddon was bathed in the Font, they say something went awry. In the child's eyes there flared a light of comprehension that startled all present and set the sacerdotes to whispering. He was raised with every expectation of following the path all scions of Avernus took--to train in war, that in times of need he might lead the family's army in defense of the ancestral lands. But Abaddon was always one apart. Where others trained with weapons, he bent himself to meditation in the presence of the mist. He drank deep from the vapors that welled from the Font, learning to blend his spirit with the potency that flowed from far beneath the House; he became a creature of the black mist.   There was bitterness within the House Avernus--elders and young alike accusing him of neglecting his responsibilities. But all such accusations stopped when Abaddon rode into battle, and they saw how the powers of the mist had given him mastery over life and death beyond those of any lord the House had ever known."}