{"skills": [{"skilldesc": "Places a frozen hex on an enemy unit that deals damage over time, but can be dispelled by moving away from the initial cast point.  If the enemy unit doesn't move outside of the given range, it will be stunned and frozen in place after 4 seconds.", "skillname": "Cold Feet", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_cold_feet_hp1.png"}, {"skilldesc": "Creates a vortex of icy energy that slows movement speed and increases magic damage done in its range.  Lasts 16 seconds.", "skillname": "Ice Vortex", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_ice_vortex_hp1.png"}, {"skilldesc": "A frigid gust enchants allied heroes, granting them bonus magical damage for a given number of physical attacks, while slowing their attack speed slightly.  Ancient Apparition always receives the buff. Lasts 30 seconds.", "skillname": "Chilling Touch", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_chilling_touch_hp1.png"}, {"skilldesc": "An explosive ball of icy hail that can be used to strike targets anywhere on the map. On first use, Kaldr launches a tracer towards the targeted location.  The second use marks the current location of the blast, upon which the actual projectile is launched - the greater the distance, the larger the radius affected. It deals damage to enemy units and applies a frostbite curse to units in and around the area that prevents regeneration or healing. Frostbitten units will take minor damage over time; if the units drop below a certain percentage of hitpoints, they'll instantly shatter.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Ice Blast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_ice_blast_hp1.png"}, {"skilldesc": "Releases the ice blast early at its current location.", "skillname": "Release", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_ice_blast_release_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/ancient_apparition_full.png", "name": "Ancient Apparition", "desc": "Kaldr, the Ancient Apparition, is an image projected from outside time. He springs from the cold, infinite void that both predates the universe and awaits its end. Kaldr is, Kaldr was, Kaldr shall be...and what we perceive, powerful as it appears to us, is but the faintest faded echo of the true, eternal Kaldr. Some believe that as the cosmos ages and approaches its final moments, the brightness and power of Kaldr will also intensify--that the Ancient Apparition will grow younger and stronger as eternity's end draws nigh. His grip of ice will bring all matter to a stop, his image will cast a light too terrible to behold. An Apparition no longer!"}