{"skills": [{"skilldesc": "Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration.", "skillname": "Berserker's Call", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/axe_berserkers_call_hp1.png"}, {"skilldesc": "Enrages an enemy unit, causing it to be slowed and take damage over time until it kills another unit or the duration ends. Axe gains movement speed for each unit affected with Battle Hunger.", "skillname": "Battle Hunger", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/axe_battle_hunger_hp1.png"}, {"skilldesc": "When attacked, Axe performs a helix counter attack, dealing damage to all nearby enemies.", "skillname": "Counter Helix", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/axe_counter_helix_hp1.png"}, {"skilldesc": "Axe spots weakness and strikes, dealing moderate damage but instantly killing an enemy unit with low health.  When an enemy hero is killed in this way, the cooldown is reset. Axe and nearby allied units gain bonus movement speed.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Culling Blade", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/axe_culling_blade_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/axe_full.png", "name": "Axe", "desc": "As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best."}