{"skills": [{"skilldesc": "Weakens an enemy unit, reducing its physical damage.  Lasts 20 seconds.", "skillname": "Enfeeble", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bane_enfeeble_hp1.png"}, {"skilldesc": "Feasts on the vital energies of an enemy unit, dealing damage and gaining health equal to the damage dealt.", "skillname": "Brain Sap", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bane_brain_sap_hp1.png"}, {"skilldesc": "Puts the target enemy or friendly Hero to sleep and deals damage per second.  Sleeping units are awakened when attacked, but the Nightmare passes to the attacking unit.  The nightmared unit instantly wakes up if it takes damage.", "skillname": "Nightmare", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bane_nightmare_hp1.png"}, {"skilldesc": "CHANNELED - Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every second based on the unit's maximum mana.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Fiend's Grip", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bane_fiends_grip_hp1.png"}, {"skilldesc": "Wakes you up from a nightmare.", "skillname": "Nightmare End", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bane_nightmare_end_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/bane_full.png", "name": "Bane", "desc": "When the gods have nightmares, it is Bane Elemental who brings them.  Also known as Atropos, Bane was born from the midnight terrors of the goddess Nyctasha.  A force of terror too powerful to be contained by sleep, he surfaced from her slumbers, fed upon her immortality, and stole his vaporous form from her inky blood.  He is the essence of fear.  Mortals who hear his voice hear their darkest secrets whispered in their ear.  He calls to the hidden fear in every Hero's heart.  Wakefulness is no protection, for Bane's black blood, continuously dripping, is a tar that traps his enemies in nightmare.  In the presence of Bane, every Hero remembers to fear the dark."}