{"skills": [{"skilldesc": "Drives a unit into a bloodthirsty rage, during which it has higher attack damage, but cannot cast spells and takes damage every second.  Bloodrage dispels the target before applying its buff.", "skillname": "Bloodrage", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bloodseeker_bloodrage_hp1.png"}, {"skilldesc": "Bloodseeker revels in combat, regaining health with every unit he kills or whenever an enemy Hero dies within a 325 radius of Bloodseeker.  The health gained is a percentage of the killed unit's maximum HP.", "skillname": "Blood Bath", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bloodseeker_blood_bath_hp1.png"}, {"skilldesc": "Enables Bloodseeker to sense enemy Heroes with health below a certain percentage wherever they are, giving him vision of that unit, increased movement speed and increased damage. Bonuses stack per Hero.  Bloodseeker gains True Sight of enemy Heroes below half their visiblity threshold.", "skillname": "Thirst", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bloodseeker_thirst_hp1.png"}, {"skilldesc": "Causes an enemy unit's skin to rupture, dealing massive damage. If the unit moves while under the effect of Rupture, it takes a percentage of the distance traveled as damage.  The damage is dealt through magic immunity.", "skillname": "Rupture", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/bloodseeker_rupture_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/bloodseeker_full.png", "name": "Bloodseeker", "desc": "Strygwyr the Bloodseeker is a ritually sanctioned hunter, Hound of the Flayed Twins, sent down from the mist-shrouded peaks of Xhacatocatl in search of blood. The Flayed Ones require oceanic amounts of blood to keep them sated and placated, and would soon drain their mountain empire of its populace if the priests of the high plateaus did not appease them. Strygwyr therefore goes out in search of carnage. The vital energy of any blood he lets, flows immediately to the Twins through the sacred markings on his weapons and armor. Over the years, he has come to embody the energy of a vicious hound; in battle he is savage as a jackal. Beneath the Mask of the Bloodseeker, in the rush of bloody quenching, it is said that you can sometime see the features of the Flayers taking direct possession of their Hound."}