{"skills": [{"skilldesc": "Throws a mysterious bolt of energy at the target unit. It stuns for a random duration and deals random damage.", "skillname": "Chaos Bolt", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/chaos_knight_chaos_bolt_hp1.png"}, {"skilldesc": "Teleports you, any images you have and the target unit to a random point along the line between the two of you. Gives you bonus attack damage for one attack.", "skillname": "Reality Rift", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/chaos_knight_reality_rift_hp1.png"}, {"skilldesc": "Chaos Knight's mojo gives him a chance to deal bonus damage.", "skillname": "Chaos Strike", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/chaos_knight_chaos_strike_hp1.png"}, {"skilldesc": "Summons several phantasmal copies of the Chaos Knight from alternate dimensions. There is a 50% chance an extra phantasm will be summoned. The phantasms deal full damage, but take double damage.", "skillname": "Phantasm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/chaos_knight_phantasm_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/chaos_knight_full.png", "name": "Chaos Knight", "desc": "The veteran of countless battles on a thousand worlds, Chaos Knight hails from a far upstream plane where the fundamental laws of the universe have found sentient expression.  Of all the ancient Fundamentals, he is the oldest and most tireless, endlessly searching out a being he knows only as \"The Light.\"  Long ago the Light ventured out from the progenitor realm, in defiance of the first covenant.  Now Chaos Knight shifts from plane to plane, always on the hunt to extinguish the Light wherever he finds it.  A thousand times he has snuffed out the source, and always he slides into another plane to continue his search anew.   Upon his steed Armageddon he rides, wading into battle with maniacal frenzy, drawing strength from the disorder of the universe.  A physical manifestation of chaos itself, in times of need he calls upon other versions of himself from other planes, and together these dark horsemen ride into battle, as unstoppable as any force of nature.  Only when the last Light of the world is scoured from existence will the search be ended.  Where rides the Chaos Knight, death soon follows."}