{"skills": [{"skilldesc": "Discharges high-powered shrapnel at random nearby enemy units, dealing minor magical damage and ministun.", "skillname": "Battery Assault", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/rattletrap_battery_assault_hp1.png"}, {"skilldesc": "Forms a barrier of energized cogs around Clockwerk, trapping any units that are near.  Enemies outside the trap that touch a cog are knocked back, losing health and mana. Once a cog has delivered a shock, it will power down.  Cogs can be destroyed by enemy attacks, but Clockwerk can destroy them with just one.", "skillname": "Power Cogs", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/rattletrap_power_cogs_hp1.png"}, {"skilldesc": "Fires a global range flare that explodes over a given area, damaging enemies and providing vision for 10 seconds.", "skillname": "Rocket Flare", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/rattletrap_rocket_flare_hp1.png"}, {"skilldesc": "Fires a grappling device rapidly at the target location.  If the hook hits a non-neutral unit, Clockwerk launches himself into the target, stunning and dealing damage.  Any enemies Clockwerk collides with along the way are subject to damage and stunned. \n\nUpgradable by Aghanim's Scepter.", "skillname": "Hookshot", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/rattletrap_hookshot_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/rattletrap_full.png", "name": "Clockwerk", "desc": "Rattletrap descends from the same far-flung kindred as Sniper and Tinker, and like many of the Keen Folk, has offset his diminutive stature through the application of gadgetry and wit.  The son of the son of a clockmaker, Rattletrap was many years apprenticed to that trade before war rode down from the mountains and swept the plains villages free of such innocent vocations.  \"Your new trade is battle,\" his dying father told him as the village of their ancestors lay in charred and smoking ruins.     It is a poor tradesman who blames his tools, and Rattletrap was never one to make excuses.  After burying his father among the ruins of their village, he set about to transform himself into the greatest tool of warfare that any world had ever seen. He vowed to never again be caught unprepared, instead using his talents to assemble a suit of powered Clockwerk armor to make the knights of other lands look like tin cans by comparison.  Now Rattletrap is alive with devices, a small but deadly warrior whose skills at ambush and destruction have risen to near-automated levels of efficiency.  An artisan of death, his mechanizations make short work of the unwary, heralding a new dawn in this age of warfare.  What time is it? It's Clockwerk time!"}