{"skills": [{"skilldesc": "A burst of damaging frost slows enemy movement and attack rate in the targeted area.", "skillname": "Crystal Nova", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/crystal_maiden_crystal_nova_hp1.png"}, {"skilldesc": "Encases an enemy unit in ice, prohibiting movement and attack, while dealing damage per second. Lasts 10 seconds on creeps level 6 or lower.", "skillname": "Frostbite", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/crystal_maiden_frostbite_hp1.png"}, {"skilldesc": "Gives additional mana regeneration to all friendly units on the map. This bonus is doubled on Crystal Maiden.", "skillname": "Arcane Aura", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/crystal_maiden_brilliance_aura_hp1.png"}, {"skilldesc": "CHANNELED - Surrounds Crystal Maiden with random icy explosions that slow enemies and deal massive damage.  Lasts 7 seconds.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Freezing Field", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/crystal_maiden_freezing_field_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/crystal_maiden_full.png", "name": "Crystal Maiden", "desc": "Born in a temperate realm, raised with her fiery older sister Lina, Rylai the Crystal Maiden soon found that her innate elemental affinity to ice created trouble for all those around her. Wellsprings and mountain rivers froze in moments if she stopped to rest nearby; ripening crops were bitten by frost, and fruiting orchards turned to mazes of ice and came crashing down, spoiled. When their exasperated parents packed Lina off to the equator, Rylai found herself banished to the cold northern realm of Icewrack, where she was taken in by an Ice Wizard who had carved himself a hermitage at the crown of the Blueheart Glacier. After long study, the wizard pronounced her ready for solitary practice and left her to take his place, descending into the glacier to hibernate for a thousand years. Her mastery of the Frozen Arts has only deepened since that time, and now her skills are unmatched."}