{"skills": [{"skilldesc": "Dark Seer creates a vacuum over the target area that sucks in enemy units, disrupting them and dealing damage.", "skillname": "Vacuum", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dark_seer_vacuum_hp1.png"}, {"skilldesc": "Surrounds the target unit with a bristling shield that damages enemy units in an area around it.", "skillname": "Ion Shell", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dark_seer_ion_shell_hp1.png"}, {"skilldesc": "Charges a target friendly unit with power, giving it a brief burst of maximum movement speed.", "skillname": "Surge", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dark_seer_surge_hp1.png"}, {"skilldesc": "Raises a wall of warping light that damages and creates replicas of any enemy hero who crosses it. Enemy replicas serve at the Dark Seer's will.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Wall of Replica", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dark_seer_wall_of_replica_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/dark_seer_full.png", "name": "Dark Seer", "desc": "Fast when he needs to be, and a cunning strategist, Ish'Kafel the Dark Seer requires no edged weapons to vanquish his enemies, relying instead on the strength of his powerful mind. His talent lies in his ability to maneuver the fight to his advantage. Hailing from a place he calls 'The Land behind the wall,' Dark Seer remains an outsider here-a warrior from a realm beyond the veil of this reality.   Once a great general among his people, and a valiant defender of the god-king Damathryx, Dark Seer's army was wiped out by a much larger force in the final days of the Great Boundaries War. Facing certain defeat, he made one last desperate act: he led the enemy forces into the maze between the walls. At the last moment, just before capture, he crossed over-then sealed the walls forever in an explosive release of dark energy. When the dust settled, he saw that he had saved his people but found himself blinking at the sun of a different world, with no way to return.  Now he is committed to proving his worth as a military strategist, and vows to show that he's the greatest tactician this strange new world has ever seen."}