{"skills": [{"skilldesc": "Unleashes a breath of fire on enemy units in a line in front of Dragon Knight.", "skillname": "Breathe Fire", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dragon_knight_breathe_fire_hp1.png"}, {"skilldesc": "Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage.  When in Elder Dragon Form, the cast range increases to 400.", "skillname": "Dragon Tail", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dragon_knight_dragon_tail_hp1.png"}, {"skilldesc": "The life blood of the Dragon improves health regeneration and strengthens armor.", "skillname": "Dragon Blood", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dragon_knight_dragon_blood_hp1.png"}, {"skilldesc": "Dragon Knight can take the form of three powerful elder dragons.\nLEVEL 1 - Green Dragon: Short poison damage over time on attack.\nLEVEL 2 - Red Dragon: Splash damage on attack.\nLEVEL 3 - Blue Dragon: Splash damage and frost attack that slows enemy units.", "skillname": "Elder Dragon Form", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/dragon_knight_elder_dragon_form_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/dragon_knight_full.png", "name": "Dragon Knight", "desc": "After years on the trail of a legendary Eldwurm, the Knight Davion found himself facing a disappointing foe: the dreaded Slyrak had grown ancient and frail, its wings tattered, its few remaining scales stricken with scale-rot, its fangs ground to nubs, and its fire-gouts no more threatening than a pack of wet matchsticks. Seeing no honor to be gained in dragon-murder, Knight Davion prepared to turn away and leave his old foe to die in peace. But a voice crept into his thoughts, and Slyrak gave a whispered plea that Davion might honor him with death in combat. Davion agreed, and found himself rewarded beyond expectation for his act of mercy: As he sank his blade in Slyrak's breast, the dragon pierced Davion's throat with a talon. As their blood mingled, Slyrak sent his power out along the Blood Route, sending all its strength and centuries of wisdom to the knight.  The dragon's death sealed their bond and Dragon Knight was born. The ancient power slumbers in the Dragon Knight Davion, waking when he calls it. Or perhaps it is the Dragon that calls the Knight..."}