{"skills": [{"skilldesc": "Ember Spirit unleashes fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second.", "skillname": "Searing Chains", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ember_spirit_searing_chains_hp1.png"}, {"skilldesc": "Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area of effect, then returning to his start location.  Deals bonus damage to heroes, and less damage to creeps.", "skillname": "Sleight of Fist", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ember_spirit_sleight_of_fist_hp1.png"}, {"skilldesc": "Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, leaving him unharmed.  Flame Guard deals damage per second in an area around Ember Spirit while Flame Guard is active.  If the shield is broken, the damage is also lost.", "skillname": "Flame Guard", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ember_spirit_flame_guard_hp1.png"}, {"skilldesc": "Select the Fire Remnant to arrive at.", "skillname": "Activate Fire Remnant", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ember_spirit_activate_fire_remnant_hp1.png"}, {"skilldesc": "Ember Spirit generates Fire Remnant charges every 35 seconds, with a max of 3 charges.  Releasing a charge sends a Fire Remnant that runs to the target location at 2.5x Ember Spirit's speed.  Using Activate Fire Remnant, Ember Spirit can dash out to his Remnants, exploding them for area of effect damage.  The targeted Remnant will be arrived at last.", "skillname": "Fire Remnant", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ember_spirit_fire_remnant_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/ember_spirit_full.png", "name": "Ember Spirit", "desc": "Lost within the Wailing Mountains, the Fortress of Flares lay abandoned, its training halls empty, its courtyard covered in leaves and dust. Upon a dais in its sealed temple rests a topaz cauldron filled with ancient ash, remnants of a pyre for the warrior-poet Xin. For three generations, Xin taught his acolytes the Bonds of the Guardian Flame, a series of mantras to train the mind and body for the harsh realities beyond the fortress walls. However, in teaching a warrior's way he earned a warrior's rivals, and in his autumn Xin was bested and slain. His followers spread to the wind. Yet as years turned to centuries and followers to descendants, his teachings endured by subtle whisper and deed. Touched by the teacher's lasting legacy, the Burning Celestial, inquisitive aspect of fire, cast himself to the Fortress of Flares and reignited the pyre ash. From these glowing embers emerged an image of Xin, wreathed in flame, his thoughtful countenance prepared to train and to teach, and to spread the fires of knowledge to all who seek guidance."}