{"skills": [{"skilldesc": "Enchantress beguiles her enemies, slowing their attacks when she is attacked.  Lasts 4 seconds.", "skillname": "Untouchable", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_untouchable_hp1.png"}, {"skilldesc": "Enchantress charms an enemy, bringing it under her control (if a creep) or slowing it (if a hero).", "skillname": "Enchant", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_enchant_hp1.png"}, {"skilldesc": "A cloud of wisps heals Enchantress and any friendly units nearby.  Lasts 10 seconds.", "skillname": "Nature's Attendants", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_natures_attendants_hp1.png"}, {"skilldesc": "Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is.  The farther the target, the greater the damage dealt.\n\nImpetus is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Impetus", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_impetus_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/enchantress_full.png", "name": "Enchantress", "desc": "Aiushtha appears to be an innocent, carefree creature of the woods, and while this is certainly true, it is hardly the sum of her story. She well understands the suffering of the natural world. She has wandered far, and fared through forests bright and drear, in every clime and every season, gathering friends, sharing news, bringing laughter and healing wherever she goes. For in worlds wracked by war, forests are leveled for the building of ships and siege engines; and even in places of peace, the woods are stripped for the building of homes, and as fuel for countless hearths. Aiushtha hears the pleas of the small creatures, the furtive folk who need green shade and a leafy canopy to thrive. She lends her ears to those who have no other listeners. She carries their stories from the wood to the world, believing that her own good cheer is a kind of Enchantment, that can itself fulfill the promise of a verdant future."}