{"skills": [{"skilldesc": "Focuses Enigma's power on a target, causing it to take damage and become repeatedly stunned for multiple instances.  An instance strikes every 2 seconds.", "skillname": "Malefice", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enigma_malefice_hp1.png"}, {"skilldesc": "Transforms a creep into three fragments of Engima himself.  These eidolons are all under Enigma's control, and repeated successful attacks cause them to multiply.  When this happens, the eidolons have their health restored.", "skillname": "Demonic Conversion", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enigma_demonic_conversion_hp1.png"}, {"skilldesc": "Steeps an area in dark resonance, damaging enemy units based on their max HP.", "skillname": "Midnight Pulse", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enigma_midnight_pulse_hp1.png"}, {"skilldesc": "CHANNELED - Summons a vortex that sucks in nearby enemy units.  Enemies affected by Black Hole cannot move, attack, or cast spells.  The closer units get to the center, the more damage is dealt.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Black Hole", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/enigma_black_hole_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/enigma_full.png", "name": "Enigma", "desc": "Nothing is known of Enigma's background. There are only stories and legends, most of them apocryphal, passed down through the ages. In truth, Enigma is a mystery for whom the only true biography is description: he is a universal force, a consumer of worlds. He is a being of the void, at times corporeal, other times ethereal. A beast between the planes.  There are stories that say he was once a great alchemist who tried to unlock the secrets of the universe and was cursed for his arrogance. Other legends tell that he is an ancient being of strange gravity, the abyss personified-a twisted voice from out the original darkness, before the first light in the universe. And there are older legends that say he is the first collapsed star, a black hole grown complicated and sentient-his motivations unknowable, his power inexorable, a force of destruction unleashed upon existence itself."}