{"skills": [{"skilldesc": "Unlocks the regenerative power of a friendly unit, with healing based upon its primary attribute. If the target is below 40% it will heal faster.  Lasts 16 seconds.", "skillname": "Inner Vitality", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/huskar_inner_vitality_hp1.png"}, {"skilldesc": "Huskar sets his spears aflame, dealing damage over time with his regular attack.  Multiple attacks will stack additional damage.  Each attack drains some of Huskar's health.  Lasts 8 seconds.", "skillname": "Burning Spear", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/huskar_burning_spear_hp1.png"}, {"skilldesc": "Huskar's injuries feed his power, giving increased attack speed and magic resistance based on missing health.", "skillname": "Berserker's Blood", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/huskar_berserkers_blood_hp1.png"}, {"skilldesc": "Huskar draws upon his health to break an enemy's life, leaping at a target within attack range to inflict a percentage of that hero's current HP, and slow at the cost of his own vitality.  While leaping, Huskar is magic immune.  Slow lasts 5 seconds.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Life Break", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/huskar_life_break_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/huskar_full.png", "name": "Huskar", "desc": "Emerging from the throes of the sacred Nothl Realm, Huskar opened his eyes to see the prodigal shadow priest Dazzle working a deep incantation over him. Against the ancient rites of the Dezun Order, Huskar's spirit had been saved from eternity, but like all who encounter the Nothl he found himself irrevocably changed. No longer at the mercy of a mortal body, his very lifeblood became a source of incredible power; every drop spilled was returned tenfold with a fierce, burning energy. However this newfound gift infuriated Huskar, for in his rescue from the Nothl, Dazzle had denied him a place among the gods. He had been denied his own holy sacrifice. In time the elders of the order sought to expand their influence and Huskar, they agreed, would be a formidable tool in their campaign. Yet becoming a mere weapon for the order that denied him his birthright only upset him further. As the first embers of war appeared on the horizon, he fled his ancestral home to find new allies, all the while seeking a cause worthy of unleashing the power his total sacrifice could bring."}