{"skills": [{"skilldesc": null, "skillname": "Quas", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_quas_hp1.png"}, {"skilldesc": null, "skillname": "Wex", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_wex_hp1.png"}, {"skilldesc": null, "skillname": "Exort", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_exort_hp1.png"}, {"skilldesc": "Combines the properties of the elements currently being manipulated, creating a new spell at the Invoker's disposal. Click the help button to see the list of possible spells.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Invoke", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_invoke_hp1.png"}, {"skilldesc": null, "skillname": "Cold Snap", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_cold_snap_hp1.png"}, {"skilldesc": null, "skillname": "Ghost Walk", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_ghost_walk_hp1.png"}, {"skilldesc": null, "skillname": "Tornado", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_tornado_hp1.png"}, {"skilldesc": null, "skillname": "EMP", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_emp_hp1.png"}, {"skilldesc": null, "skillname": "Alacrity", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_alacrity_hp1.png"}, {"skilldesc": null, "skillname": "Chaos Meteor", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_chaos_meteor_hp1.png"}, {"skilldesc": null, "skillname": "Sun Strike", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_sun_strike_hp1.png"}, {"skilldesc": null, "skillname": "Forge Spirit", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_forge_spirit_hp1.png"}, {"skilldesc": null, "skillname": "Ice Wall", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_ice_wall_hp1.png"}, {"skilldesc": null, "skillname": "Deafening Blast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/invoker_deafening_blast_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/invoker_full.png", "name": "Invoker", "desc": "In its earliest, and some would say most potent form, magic was primarily the art of memory. It required no technology, no wands or appurtenances other than the mind of the magician. All the trappings of ritual were merely mnemonic devices, meant to allow the practitioner to recall in rich detail the specific mental formulae that unlocked a spell's power. The greatest mages in those days were the ones blessed with the greatest memories, and yet so complex were the invocations that all wizards were forced to specialize. The most devoted might hope in a lifetime to have adequate recollection of three spells--four at most. Ordinary wizards were content to know two, and it was not uncommon for a village mage to know only one--with even that requiring him to consult grimoires as an aid against forgetfulness on the rare occasions when he might be called to use it. But among these early practitioners there was one exception, a genius of vast intellect and prodigious memory who came to be known as the Invoker. In his youth, the precocious wizard mastered not four, not five, not even seven incantations: He could command no fewer than ten spells, and cast them instantly. Many more he learned but found useless, and would practice once then purge from his mind forever, to make room for more practical invocations. One such spell was the Sempiternal Cantrap--a longevity spell of such power that those who cast it in the world's first days are among us still (unless they have been crushed to atoms). Most of these quasi-immortals live quietly, afraid to admit their secret: But Invoker is not one to keep his gifts hidden. He is ancient, learned beyond all others, and his mind somehow still has space to contain an immense sense of his own worth...as well as the Invocations with which he amuses himself through the long slow twilight of the world's dying days."}