{"skills": [{"skilldesc": "Tether yourself to an allied hero, granting both of you bonus movement speed. When you restore health or mana, your target gains 1.5x the amount. Any enemy unit that crosses the tether is slowed. The tether breaks when the allied unit moves too far away, or Io cancels the tether.", "skillname": "Tether", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_tether_hp1.png"}, {"skilldesc": "Break the link to the tethered unit.", "skillname": "Break Tether", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_tether_break_hp1.png"}, {"skilldesc": "Summon five particle spirits that dance in a circle around Io, damaging all that they hit around you. If a particle hits an enemy hero, it explodes, damaging all enemy units in an area around it.  Creeps take minor damage from touching a particle spirits, but don't cause them to explode.  After the duration, the Spirits will explode.", "skillname": "Spirits", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_spirits_hp1.png"}, {"skilldesc": "Io gains bonus attack speed and damage reduction, at the cost of draining HP and mana per second.  If Io is Tethered to an ally, that unit also gains the bonuses.", "skillname": "Overcharge", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_overcharge_hp1.png"}, {"skilldesc": "Teleport yourself and any tethered ally to any location on the map. After the spell expires you and any tethered ally will return to where you teleported from.", "skillname": "Relocate", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_relocate_hp1.png"}, {"skilldesc": "Calls the spirits closer to you. Can be toggled on and off.", "skillname": "Spirits In", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_spirits_in_hp1.png"}, {"skilldesc": "Sends the spirits farther away from you. Can be toggled on and off.", "skillname": "Spirits Out", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/wisp_spirits_out_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/wisp_full.png", "name": "Io", "desc": "Io is everywhere, and in all things.  Denounced by enemies as the great unmaker, worshiped by scholars as the twinkling of a divine eye, this strange Wisp of life-force occupies all planes at once, the merest fraction of its being crossing into physical existence at any one moment.   Like the great twin riders Dark and Light, and yet another ancient traveler whose true history is lost to the ages, Io the Wisp is a Fundamental of the universe, a force older than time, a wanderer from realms far beyond mortal understanding. Io is nothing less than the sum of all attractive and repulsive forces within the material field, a sentient manifestation of the charge that binds existence together. It is only in the controlled warping of these electrical waylines that Io's presence can be experienced on the physical plane. A benevolent, cooperative force, Io bonds its strange magnetism to others so that the power of allies might be enhanced.  Its motives inscrutable, its strength unimaginable, Io moves through the physical plane, the perfect expression of the mysteries of the universe."}