{"skills": [{"skilldesc": "An icy blast followed by a wave of fire launches out in a path in front of Jakiro. The ice slows enemies, while the fire delivers damage over time.", "skillname": "Dual Breath", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/jakiro_dual_breath_hp1.png"}, {"skilldesc": "Creates a path of ice that stuns and damages enemies that touch it.", "skillname": "Ice Path", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/jakiro_ice_path_hp1.png"}, {"skilldesc": "Jakiro burns his enemies in an area of effect with fire added to his attack, while slowing their attacks.\n\nLiquid Fire is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers.", "skillname": "Liquid Fire", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/jakiro_liquid_fire_hp1.png"}, {"skilldesc": "Jakiro lays down a line of flame in front of him, each dealing damage per second to enemy units in a wide area of effect.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Macropyre", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/jakiro_macropyre_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/jakiro_full.png", "name": "Jakiro", "desc": "Even among magical beasts, a twin-headed dragon is a freak. Equal parts ice and fire, cunning and rage, the creature known as Jakiro glides over charred and ice-bound battlefields, laying waste to any who would bear arms against it. Pyrexae dragon clutches always contain two fledglings. Famous for their viciousness even from the first moments of life, newly hatched dragons of this species will try to kill their sibling while still in the nest. Only the strongest survive. In this way is the strength of the Pyrexae line ensured. By some accident of nature, the freak Jakiro hatched from a single egg, combining in a single individual the full range of abilities found within the diverse Pyrexae species. Trapped within the armature of its monstrous body, the powers of ice and fire combine, and now no enemy is safe."}