{"skills": [{"skilldesc": "Causes a bladestorm of destructive force around Juggernaut, rendering him immune to magic and dealing damage to nearby enemy units.  Lasts 5 seconds.", "skillname": "Blade Fury", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/juggernaut_blade_fury_hp1.png"}, {"skilldesc": "Summons a Healing Ward that heals all nearby allied units, based on their max hit points.  The Healing Ward can move at 450 movement speed after being summoned.  Lasts 25 seconds.", "skillname": "Healing Ward", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/juggernaut_healing_ward_hp1.png"}, {"skilldesc": "Gives Juggernaut a chance to deal double damage on each attack.", "skillname": "Blade Dance", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/juggernaut_blade_dance_hp1.png"}, {"skilldesc": "Juggernaut leaps towards the target enemy unit with a damaging attack, and then slashes other nearby enemy units, dealing between 175-250 damage per slash.  Juggernaut is invulnerable for the duration.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Omnislash", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/juggernaut_omni_slash_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/juggernaut_full.png", "name": "Juggernaut", "desc": "No one has ever seen the face hidden beneath the mask of Yurnero the Juggernaut. It is only speculation that he even has one. For defying a corrupt lord, Yurnero was exiled from the ancient Isle of Masks--a punishment that saved his life. The isle soon after vanished beneath the waves in a night of vengeful magic. He alone remains to carry on the Isle's long Juggernaut tradition, one of ritual and swordplay. The last practitioner of the art, Yurnero's confidence and courage are the result of endless practice; his inventive bladework proves that he has never stopped challenging himself. Still, his motives are as unreadable as his expression. For a hero who has lost everything twice over, he fights as if victory is a foregone conclusion."}