{"skills": [{"skilldesc": "Splits the earth under enemies. Deals damage and stuns for a short duration.", "skillname": "Split Earth", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_split_earth_hp1.png"}, {"skilldesc": "Saturates the area around Leshrac with magical explosions that deal mixed damage to enemy units and structures.  The fewer units available to attack, the more damage those units will take.  Lasts 8 seconds.", "skillname": "Diabolic Edict", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_diabolic_edict_hp1.png"}, {"skilldesc": "Summons a lightning storm that blasts the target enemy unit, then jumps to nearby enemy units. Struck enemies are slowed by 75% for 0.5 seconds.", "skillname": "Lightning Storm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_lightning_storm_hp1.png"}, {"skilldesc": "Creates waves of damaging energy around Leshrac, one per second, to damage nearby enemy units.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Pulse Nova", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_pulse_nova_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/leshrac_full.png", "name": "Leshrac", "desc": "Leshrac, Tormented Soul, is an entity torn from the heart of nature, a liminal being that exists half in one plane of existence, half in another. His penetrating intelligence is such that he can never ignore for a moment the agonizing horror at the heart of all creation. Once a great philosopher who sought the meaning of existence, he plumbed the depths of nature with the haunted Chronoptic Crystals, and was forever altered by the hideous mysteries thereby revealed to him. Now the darkest depths of his enlightenment are illumined only by the fitful glare of his arrogance. Like other elemental characters, he is completely at one with nature, but in his case it is a nature lurid and vile. He alone sees the evil truth of reality, and has no use for those who believe the cosmos reserves a special reward for those who practice benevolence."}