{"skills": [{"skilldesc": "Launch into a maddened rage, becoming immune to magic spells and gaining increased attack speed.", "skillname": "Rage", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/life_stealer_rage_hp1.png"}, {"skilldesc": "Regenerates a portion of the attacked enemy's current HP and deals the same portion of damage per attack.", "skillname": "Feast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/life_stealer_feast_hp1.png"}, {"skilldesc": "Lifestealer rends an enemy unit, slowing the victim's movespeed and allowing all allies to lifesteal on that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration.", "skillname": "Open Wounds", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/life_stealer_open_wounds_hp1.png"}, {"skilldesc": "Lifestealer will infest the body of the target unit, lying dormant and undetectable inside. When he reveals himself, he deals damage to all nearby enemy units. If the unit is a creep, he will devour it first, gaining health equal to the unit's current HP.  Does not work on enemy Heroes.", "skillname": "Infest", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/life_stealer_infest_hp1.png"}, {"skilldesc": "Lifestealer eats the host body from the inside out.", "skillname": "Consume", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/life_stealer_consume_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/life_stealer_full.png", "name": "Lifestealer", "desc": "In the dungeons of Devarque, a vengeful wizard lay in shackles, plotting his escape. He shared his cell with a gibbering creature known as N'aix, a thief cursed by the Vile Council with longevity, so that its life-sentence for theft and cozening might be as punishing as possible. Over the years, its chains had corroded, along with its sanity; N'aix retained no memory of its former life and no longer dreamt of escape. Seeing a perfect vessel for his plans, the wizard wove a spell of Infestation and cast his life-force into N'aix's body, intending to compel N'aix to sacrifice itself in a frenzy of violence while the mage returned to his body and crept away unnoticed. Instead, the wizard found his mind caught in a vortex of madness so powerful that it swept away his plans and shattered his will. Jarred to consciousness by the sudden infusion of fresh life, N'aix woke from its nightmare of madness and obeyed the disembodied voice that filled its skull, which had only the one thought: To escape. In that moment Lifestealer was born. The creature cast its mind into dungeon guards and soldiers, compelling them to open locks and cut down their companions, opening an unobstructed path to freedom while feeding on their lives. Lifestealer still wears the broken shackles as a warning that none may hold him, but on the inside remains a prisoner. Two minds inhabit the single form--a nameless creature of malevolent cunning, and the Master whose voice he pretends to obey."}