{"skills": [{"skilldesc": "Lina channels the breath of a dragon, sending out a wave of fire that scorches every enemy in its path.", "skillname": "Dragon Slave", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lina_dragon_slave_hp1.png"}, {"skilldesc": "Summons a column of flames that damages and stuns enemies.", "skillname": "Light Strike Array", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lina_light_strike_array_hp1.png"}, {"skilldesc": "Grants bonus attack and movement speed each time Lina casts a spell. Stacks with itself. Lasts 9 seconds.", "skillname": "Fiery Soul", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lina_fiery_soul_hp1.png"}, {"skilldesc": "Fires off a bolt of lightning at a single enemy unit, dealing massive damage.\n\nUpgradable with Aghanim's Scepter.", "skillname": "Laguna Blade", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lina_laguna_blade_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/lina_full.png", "name": "Lina", "desc": "The sibling rivalries between Lina the Slayer, and her younger sister Rylai, the Crystal Maiden, were the stuff of legend in the temperate region where they spent their quarrelsome childhoods together. Lina always had the advantage, however, for while Crystal was guileless and naive, Lina's fiery ardor was tempered by cleverness and conniving. The exasperated parents of these incompatible offspring went through half a dozen homesteads, losing one to fire, the next to ice, before they realized life would be simpler if the children were separated. As the oldest, Lina was sent far south to live with a patient aunt in the blazing Desert of Misrule, a climate that proved more than comfortable for the fiery Slayer. Her arrival made quite an impression on the somnolent locals, and more than one would-be suitor scorched his fingers or went away with singed eyebrows, his advances spurned. Lina is proud and confident, and nothing can dampen her flame."}