{"skills": [{"skilldesc": "Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall.", "skillname": "Earth Spike", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lion_impale_hp1.png"}, {"skilldesc": "Transforms an enemy unit into a harmless beast, with all special abilities disabled.", "skillname": "Hex", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lion_voodoo_hp1.png"}, {"skilldesc": "CHANNELED - Absorbs the magical energies of a target enemy unit by taking mana from it every second.", "skillname": "Mana Drain", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lion_mana_drain_hp1.png"}, {"skilldesc": "Rips at an enemy unit, trying to turn it inside-out. Deals massive damage.\n\nUpgradable with Aghanim's Scepter.", "skillname": "Finger of Death", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lion_finger_of_death_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/lion_full.png", "name": "Lion", "desc": "Once a Grandmaster of the Demon Witch tradition of sorcery, Lion earned fame among his brethren for fighting on the side of light and righteousness. But adulation corrupts. With powers surpassed only by his ambition, the mage was seduced by a demon and turned to evil, trading his soul for prestige. After committing horrible crimes that marred his soul, he was abandoned. The demon betrayed him, striking better deals with his enemies. Such was Lion's rage that he followed the demon back to hell and slew it, ripping it limb from limb, taking its demonic hand for his own. However, such demonoplasty comes at a cost. Lion was transfigured by the process, his body transformed into something unrecognizable. He rose from hell, rage incarnate, slaying even those who had once called him master, and laying waste to the lands where he had once been so adored. He survives now as the sole practitioner of the Demon Witch tradition, and those who present themselves as acolytes or students are soon relieved of their mana and carried off by the faintest gust of wind."}