{"skills": [{"skilldesc": "Summons two wolves to fight for Lycan.  Level 2-4 wolves have Critical Strike, level 3-4 wolves have permanent invisibility, and level 4 wolves have 15 HP regen.", "skillname": "Summon Wolves", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lycan_summon_wolves_hp1.png"}, {"skilldesc": "Grants bonus damage to Lycan, all allied heroes and all units under their control.", "skillname": "Howl", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lycan_howl_hp1.png"}, {"skilldesc": "Increases the damage and attack speed of Lycan and all units under his control.", "skillname": "Feral Impulse", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lycan_feral_impulse_hp1.png"}, {"skilldesc": "Lycan assumes his true form, increasing his combat capabilities.  During Shapeshift, Lycan and all units under his control move at maximum speed and cannot be slowed.", "skillname": "Shapeshift", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/lycan_shapeshift_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/lycan_full.png", "name": "Lycan", "desc": "Banehallow was noble-born to the house of Ambry, the greatest of the landed castes in the old kingdom of Slom. Before the Fall, as the King's wants grew strange, and his court grew crowded with sorcerers and charlatans, the house of Ambry was the first to rise against the avarice of the throne. No longer willing to pay homage and fealty, they instead sent six-thousand swords into the capital, where they were wiped out in the Massacre of the Apostates. And then came the teeth behind the old truth: When you strike a king's neck, you had better take his head. Enraged by the betrayal, the king exterminated the vast Ambry bloodline, sparing only the lord of the house and his youngest son, Banehallow. Before all the royal court, with the disgraced lord chained to the ornate marble floor, the King bade his magicians transform the boy into a wolf so that he might tear out his own father's throat. \"Do this,\" the king said, \"so that Lord Ambry will understand the bite of betrayal.\" Powerful magic was invoked, and the child was transformed. But though his body was changed, his spirit remained intact, and instead of biting the exposed neck of his father, he attacked his handlers, tearing them to pieces. A dozen of the King's knights perished under the wolf's teeth before they managed to drive it off into the night. Lord Ambry laughed from his chains even as the King ran him through with a sword. Now the heir to the lost house of Ambry, Banehallow wanders the trail as the Lycan, part warrior, part wolf, in search of justice for all that he lost."}