{"skills": [{"skilldesc": "Medusa magically splits her shot into several arrows. These arrows deal a lower percent of her normal damage.\n\nThe extra targets will not receive other attack effects (such as critical strike) and Unique Attack Modifiers.", "skillname": "Split Shot", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/medusa_split_shot_hp1.png"}, {"skilldesc": "A mystic snake made of energy jumps from target to target dealing damage and stealing mana. After it reaches its last target, it returns to Medusa to replenish her with mana. The snake deals more damage and steals more mana per jump.", "skillname": "Mystic Snake", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/medusa_mystic_snake_hp1.png"}, {"skilldesc": "Creates a shield that absorbs 50% of the incoming damage by using Medusa's mana.", "skillname": "Mana Shield", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/medusa_mana_shield_hp1.png"}, {"skilldesc": "Any enemy units looking at Medusa will have their movement and attack speed slowed.  If 2 seconds of total time is accumulated looking at Medusa while Stone Gaze is active, that unit will turn to stone.  Petrified units are stunned, have 100% magic resistance, and take bonus physical damage.  If the petrified unit is an illusion, it is immediately killed.", "skillname": "Stone Gaze", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/medusa_stone_gaze_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/medusa_full.png", "name": "Medusa", "desc": "Beauty is power. This thought comforted Medusa--the youngest and loveliest of three beautiful Gorgon sisters, born to a sea goddess--because she alone of the sisters was mortal. It comforted her, that is, until the day masked assailants invaded the Gorgon realm and tore the two immortal sisters from their home, unmoved by their beauty or by their tears. One of the invaders seized Medusa as well, but then cast her aside with a disgusted look: 'This one has the mortal stink upon her. We have no use for that which dies.' Humiliated, enraged, Medusa fled to the temple of her mother and cast herself before the goddess, crying, 'You denied me eternal life--therefore I beg you, give me power! Power, so I can dedicate what life I have to rescuing my sisters and avenging this injustice!' After long thought, the goddess granted her daughter's request, allowing Medusa to trade her legendary beauty for a face and form of terrifying strength. Never for a moment has Medusa regretted her choice. She understands that power is the only beauty worth possessing--for only power can change the world."}