{"skills": [{"skilldesc": "Calls down a wave of meteors to damage nearby enemy units. One random enemy unit in 175 range will take a second hit for 75% of the damage.", "skillname": "Starstorm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/mirana_starfall_hp1.png"}, {"skilldesc": "Fires an arrow with deadly precision, stunning and dealing damage to the first enemy unit it strikes. Stun duration increases based on distance to target, ranging from 0.5 to 5 seconds. Bonus damage up to 100 will be added based on the distance the arrow travelled to the target.", "skillname": "Sacred Arrow", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/mirana_arrow_hp1.png"}, {"skilldesc": "Mirana leaps forward into battle, empowering allied units with a ferocious roar that grants bonus attack and movement speed. Speed bonus lasts 10 seconds.", "skillname": "Leap", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/mirana_leap_hp1.png"}, {"skilldesc": "Turns Mirana and all allied heroes invisible. If Invisibility is broken, it will restore after fade delay if the shadow's duration has not expired.  Silence will stop Moonlight Shadow.", "skillname": "Moonlight Shadow", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/mirana_invis_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/mirana_full.png", "name": "Mirana", "desc": "Born to a royal family, a blood princess next in line for the Solar Throne, Mirana willingly surrendered any claim to mundane land or titles when she dedicated herself completely to the service of Selemene, Goddess of the Moon. Known ever since as Princess of the Moon, Mirana prowls the sacred Nightsilver Woods searching for any who would dare poach the sacred luminous lotus from the silvery pools of the Goddess's preserve. Riding on her enormous feline familiar, she is poised, proud and fearless, attuned to the phases of the moon and the wheeling of the greater constellations. Her bow, tipped with sharp shards of lunar ore, draws on the moon's power to charge its arrows of light."}