{"skills": [{"skilldesc": "Creates a damaging void that slows an enemy unit and deals damage.  Void also mini-stuns, interrupting channeling abilities. The slowing effect lasts longer at night.", "skillname": "Void", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_void_hp1.png"}, {"skilldesc": "Night Stalker horrifies the target enemy Hero, causing it to miss attacks and become silenced.  The effect lasts longer at night.", "skillname": "Crippling Fear", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_crippling_fear_hp1.png"}, {"skilldesc": "Night Stalker is in his element at night, attacking and moving with great swiftness.", "skillname": "Hunter in the Night", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_hunter_in_the_night_hp1.png"}, {"skilldesc": "Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. While Darkness is in effect, enemy units and buildings have their vision range reduced. When used at night, it extends night time by Darkness' duration.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Darkness", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_darkness_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/night_stalker_full.png", "name": "Night Stalker", "desc": "Of the Night Stalker, there is no history, only stories. There are ancient tales woven into the lore of every race and every culture, of an impossible time before sunlight and daytime, when night reigned alone and the world was covered with the creatures of darkness-creatures like Balanar the Night Stalker.  It is said that on the dawn of the First Day, all the night creatures perished. All, that is, save one. Evil's embodiment, Night Stalker delights in his malevolence. He created the primal role of the Night Terror, the Boogeyman, and as long as there have been younglings, his is the specter summoned to terrify them. This is a role he relishes-nor are these empty theatrics. He does indeed stalk the unwary, the defenseless, those who have strayed beyond the lighted paths or denied the warnings of their communities. Night Stalker serves as living proof that every child's worst nightmare....is true."}