{"skills": [{"skilldesc": "Blasts an enemy unit with a wave of fire, dealing damage and stunning the target.", "skillname": "Fireblast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ogre_magi_fireblast_hp1.png"}, {"skilldesc": "Drenches a target in volatile chemicals, causing it to burst into flames. The target is in immense pain, taking damage and moving more slowly.", "skillname": "Ignite", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ogre_magi_ignite_hp1.png"}, {"skilldesc": "Incites a frenzy in a friendly unit, increasing its movement speed and attack speed.", "skillname": "Bloodlust", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ogre_magi_bloodlust_hp1.png"}, {"skilldesc": "Blasts an enemy unit with a wave of fire, dealing damage and stunning the target.", "skillname": "Unrefined Fireblast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ogre_magi_unrefined_fireblast_hp1.png"}, {"skilldesc": "Enables the Ogre Magi to rapidly cast his spells, giving them greater potency. Gives a chance to cast a spell multiple times in one cast. Increases Fireblast's mana cost and decreases its cooldown, adds an area of effect to Ignite and reduces Bloodlust's cooldown and gives it a chance to cast on random allies around Ogre Magi.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Multicast", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/ogre_magi_multicast_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/ogre_magi_full.png", "name": "Ogre Magi", "desc": "The ordinary ogre is the creature for whom the phrase 'As dumb as a bag of rock hammers' was coined. In his natural state, an ogre is supremely incapable of doing or deciding anything. Clothed in dirt, he sometimes finds himself accidentally draped in animal skins after eating lanekill. Not an especially social creature, he is most often found affectionately consorting with the boulders or tree-stumps he has mistaken for kin (a factor that may explain the ogre's low rate of reproduction).  However, once every generation or so, the ogre race is blessed with the birth of a two-headed Ogre Magi, who is immediately given the traditional name of Aggron Stonebreak, the name of the first and perhaps only wise ogre in their line's history. With two heads, Ogre Magi finds it possible to function at a level most other creatures manage with one. And while the Ogre Magi will win no debates (even with itself), it is graced with a divine quality known as Dumb Luck--a propensity for serendipitous strokes of fortune which have allowed the ogre race to flourish in spite of enemies, harsh weather, and an inability to feed itself.  It's as if the Goddess of Luck, filled with pity for the sadly inept species, has taken Ogre Magi under her wing. And who could blame her? Poor things."}