{"skills": [{"skilldesc": "Adds extra pure damage to Outworld Devourer's attacks, based on his remaining mana pool.  Arcane Orb also does bonus damage to summoned units and illusions.\n\nArcane Orb is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers.", "skillname": "Arcane Orb", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/obsidian_destroyer_arcane_orb_hp1.png"}, {"skilldesc": "Places a target allied or enemy hero into an astral prison.  The hidden hero is invulnerable and disabled.  When cast on an enemy Hero, Harbinger temporarily steals intelligence from that hero.", "skillname": "Astral Imprisonment", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/obsidian_destroyer_astral_imprisonment_hp1.png"}, {"skilldesc": "Whenever nearby allied Heroes or Outworld Devourer itself casts a spell, it gains a chance to restore 25% of its mana pool.  Outworld Devourer also passively gains a bonus to its base mana pool.  Several skills with no cooldown and toggled spells cannot trigger Essence Aura.", "skillname": "Essence Aura", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/obsidian_destroyer_essence_aura_hp1.png"}, {"skilldesc": "Deals damage to enemy Heroes in an area of effect based on the difference between Harbinger and the affected Hero's intelligence. If the Hero takes less than the damage threshold, that Hero loses 75% of its current mana.  Sanity's Eclipse can hit units trapped in Astral Imprisonment.  If an enemy hero has the same or higher Intelligence than Outworld Devourer, Sanity's Eclipse has no effect.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Sanity's Eclipse", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/obsidian_destroyer_sanity_eclipse_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/obsidian_destroyer_full.png", "name": "Outworld Devourer", "desc": "One of a lordly and magisterial race, Harbinger prowls the edge of the Void, sole surviving sentry of an outpost on the world at the rim of the abyss. From this jagged crystalline Outworld, forever on guard, he has gazed for eternities into the heavens, alert for any stirring in the bottomless night beyond the stars. Imprinted deep in the shining lattices of his intellect lies a resonant pattern akin to prophecy, a dark music implying that eventually some evil will wake out there, beyond the edges of creation, and turn its attention to our world. With his whole being focused on his vigil, Outworld Devourer paid little attention to events closer in to the sun. But at last the clamor of the Ancients, and a sense of growing threat from within as well as without, sent him winging sunward to visit the plains of war. Harbinger's place in our own prophecies is unambiguous: he must be considered an omen of worse things to come. But his arrival in itself is bad enough."}