{"skills": [{"skilldesc": "Phoenix dives forward in an arc with a fixed distance in the targeted direction, dealing damage over time and slowing the movement speed of any units he comes into contact with, and then orbiting back to his original position. If Phoenix casts Supernova, the dive ends.", "skillname": "Icarus Dive", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_icarus_dive_hp1.png"}, {"skilldesc": "Summons 4 fire spirits that circle around you. Each spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced.", "skillname": "Fire Spirits", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_fire_spirits_hp1.png"}, {"skilldesc": "Drawing from its own inner fire, Phoenix expels a huge beam of light at the cost of its own life energy. The beam damages enemies for a percentage of their life and heals allies for half the amount. Damage scales up to twice the initial damage as the beam fires.", "skillname": "Sun Ray", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_sun_ray_hp1.png"}, {"skilldesc": "The Phoenix willingly ends its current life for the chance to be reborn. Transforms into a burning sun that scorches enemies in a huge area. The sun can be destroyed by attacks from enemy Heroes. After 6 seconds the sun explodes, stunning all nearby enemies while restoring Phoenix to full health and mana with refreshed abilities.", "skillname": "Supernova", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_supernova_hp1.png"}, {"skilldesc": "Each spirit can be launched independently at a targeted area of effect. Affected enemy units take damage over time and have their attack speed greatly reduced.", "skillname": "Launch Fire Spirit", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_launch_fire_spirit_hp1.png"}, {"skilldesc": "Immediately cancels the dive.", "skillname": "Stop Icarus Dive", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_icarus_dive_stop_hp1.png"}, {"skilldesc": "Immediately stops the Sun Ray.", "skillname": "Stop Sun Ray", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_sun_ray_stop_hp1.png"}, {"skilldesc": "Toggles slow forward movement during Sun Ray firing.", "skillname": "Toggle Movement", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/phoenix_sun_ray_toggle_move_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/phoenix_full.png", "name": "Phoenix", "desc": "Alone across an untouched darkness gleamed the Keeper's first sun, a singular point of conscious light fated to spread warmth into the empty void. Through aeons beyond count, this blinding beacon set to coalescing its incalculable energy before bursting forth the cataclysmic flare of supernova. From this inferno raced new beacons, star progeny identical to its parent, who journeyed an unlit ocean and settled in constellatory array. In time, they too would be made to propagate through supernova flame. So would this dazzling cycle of birth and rebirth repeat until all skies hewn of Titan toil deigned to twinkle and shine. By this ageless crucible the star that mortals would come to call Phoenix collapsed into being, and like its ancestors was thrust into an endless cosmos to find a place among its stellar brethren. Yet curiosity toward that which the dimming elders comfort in the darkness consumed the fledgling, and so over long cycles it inquired and studied. It learned that among worlds both whole and broken would soon stir a nexus of remarkable variety locked in an enduring conflict of cosmic consequence, a plane which would find itself in need of more influence than a dying sun's distant rays could provide. Thus this infant son of suns took terrestrial form, eagerly travelling to shine its warmth upon those who may need it most, and perhaps seize upon its solar destiny."}