{"skills": [{"skilldesc": "Releases a wave of energetic plasma that grows in power as it expands, but also zaps on contraction, dealing damage to enemy units caught in its path. Damage increases with distance from Razor.", "skillname": "Plasma Field", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/razor_plasma_field_hp1.png"}, {"skilldesc": "Creates a charged link between Razor and an enemy Hero, stealing damage from the target and giving it to Razor.", "skillname": "Static Link", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/razor_static_link_hp1.png"}, {"skilldesc": "Razor moves with increased speed, and any abilites targeted at him are instantly countered with a jolt of electricity which damages, slows, and purges buffs from enemies.", "skillname": "Unstable Current", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/razor_unstable_current_hp1.png"}, {"skilldesc": "A powerful lightning storm strikes out at enemy units with the lowest health, dealing damage and reducing their armor.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Eye of the Storm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/razor_eye_of_the_storm_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/razor_full.png", "name": "Razor", "desc": "Among the emblematic powers that populate the Underscape, Razor the Lightning Revenant is one of the most feared. With his whip of lightning, he patrols the Narrow Maze, that treacherous webwork of passages by which the souls of the dead are sorted according to their own innate intelligence, cunning and persistence. Drifting above the Maze, Razor looks down on the baffled souls below, and delivers jolts of scalding electricity that both punish and quicken the souls as they decide their own fates, hurrying on toward luminous exits or endlessly dark pits. Razor is the eternal embodiment of a dominating power, abstract and almost clinical in his application of power. Yet he has a lordly air that suggests he takes a sardonic satisfaction in his work."}