{"skills": [{"skilldesc": "Sand King burrows into the ground and tunnels forward, damaging and stunning enemy units above him as he resurfaces.", "skillname": "Burrowstrike", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sandking_burrowstrike_hp1.png"}, {"skilldesc": "CHANNELED - Sand King creates a fearsome sandstorm that damages enemy units while hiding him from vision.  The invisibility remains for a short duration after the sandstorm ends.", "skillname": "Sand Storm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sandking_sand_storm_hp1.png"}, {"skilldesc": "Sand King's attacks inject a venom that causes enemy units to explode violently upon death, spreading area damage.\n\nCaustic Finale is a Unique Attack Modifier, and does not stack with other Unique Attack Modifier.", "skillname": "Caustic Finale", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sandking_caustic_finale_hp1.png"}, {"skilldesc": "CHANNELED - After channeling for 2 seconds, Sand King sends a disturbance into the earth, causing it to shudder violently. All enemies caught within range will take damage and become slowed. Each subsequent pulse increases the radius of damage dealt.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Epicenter", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sandking_epicenter_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/sand_king_full.png", "name": "Sand King", "desc": "The sands of the Scintillant Waste are alive and sentient--the whole vast desert speaks to itself, thinking thoughts only such a vastness can conceive. But when it needs must find a form to communicate with those of more limited scope, it frees a fragment of itself, and fills a carapace of magic armor formed by the cunning Djinn of Qaldin. This essential identity calls itself Crixalis, meaning 'Soul of the Sand,' but others know it as Sand King.  Sand King takes the form of a huge arachnid, inspired by the Scintillant Waste's small but ubiquitous denizens; and this is a true outward expression of his ferocious nature. Guardian, warrior, ambassador--Sand King is all of these things, inseparable from the endless desert that gave him life."}