{"skills": [{"skilldesc": "Creates a cone of ethereal energy that strikes multiple enemy units.", "skillname": "Ether Shock", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_shaman_ether_shock_hp1.png"}, {"skilldesc": "Transforms an enemy unit into a harmless creature, disabling their attacks and abilities.", "skillname": "Hex", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_shaman_voodoo_hp1.png"}, {"skilldesc": "CHANNELED - Magically binds an enemy unit so that it cannot move or attack, while dealing damage over time.", "skillname": "Shackles", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_shaman_shackles_hp1.png"}, {"skilldesc": "Summons 10 serpent wards to attack enemy units and structures. The wards are immune to magic, and have a small area of splash damage that increases per level.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Mass Serpent Ward", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_shaman_mass_serpent_ward_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/shadow_shaman_full.png", "name": "Shadow Shaman", "desc": "Born in the Bleeding Hills, Rhasta was just a starving youngling when picked up by a travelling con-man.  For two pins of copper, the old con-man would tell your fortune. For three, he'd castrate your pig, for five, he'd circumcise your sons. For a good meal, he'd don his shaman garb, read from his ancient books, and lay a curse upon your enemies. His strange new youngling, part hill troll, part...something else, worked as assistant and lent an air of the exotic to the con-man's trade.  Always one step ahead of cheated customers, one town ahead of a pursuing patronage, the two trekked across the blighted lands until one day the con-man realized that the little youngling could actually do what he only pretended at. His ward had a gift - a gift that customers valued. And so the youngling Rhasta was thrust before the crowds, and the trade-name Shadow Shaman was born. The two continued from town to town, conjuring for money as Shadow Shaman's reputation grew. Eventually, the pair's duplicitous past caught up with them, and they were ambushed by a mob of swindled ex-clients. The con-man was slain, and for the first time, Rhasta used his powers for darkness, massacring the attackers. He buried his beloved master, and now uses his powers to destroy any who would seek to do him harm."}