{"skills": [{"skilldesc": "Banishes the targeted unit, removing it from play for the duration.  Upon returning, two illusions of the unit are created under Shadow Demon's control.", "skillname": "Disruption", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_disruption_hp1.png"}, {"skilldesc": "Curses a random enemy in an area to take increased damage.  The bonus damage is dealt as a separate instance of damage.  Units under the effect of Disruption can still be affected by Soul Catcher.", "skillname": "Soul Catcher", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_soul_catcher_hp1.png"}, {"skilldesc": "Deals damage in a line, and afflicts enemy units with a poison effect. The poison deals 1/2/4/8/16 times the stack damage based on the number of stacks on the target, up to 5 stacks. Additional stacks cause 50 damage each.  This deferred damage is dealt when Shadow Poison's duration is expired, or the Release sub-ability is used.", "skillname": "Shadow Poison", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_shadow_poison_hp1.png"}, {"skilldesc": "Releases the poison to do damage on all affected enemies. Units under the effect of Disruption can still be affected by Shadow Poison.", "skillname": "Shadow Poison Release", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_shadow_poison_release_hp1.png"}, {"skilldesc": "Purges the target enemy unit, removing positive buffs, and slowing the target for the duration.  The unit slowly regains its speed until the end of the duration, upon which damage is dealt.  Units under the effect of Disruption can still be affected by Demonic Purge.\n\nUpgradable with Aghanim's Scepter.", "skillname": "Demonic Purge", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_demonic_purge_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/shadow_demon_full.png", "name": "Shadow Demon", "desc": "Among the sovereign Demons with explicit access to this world, Doom scarcely bothers with the affairs of Noninfernals and Lesser Spectral Consorts, while Shadow Fiend passes through almost exclusively on collecting expeditions. The Shadow Demon, however, has always taken a deep and abiding interest in the material plane, as if sensing that mastery of this gritty dimensional nexus might be the key to total domination of all realities. Summoned first by minor wizards, the Shadow Demon granted every wish and put on increasingly impressive displays of power until he had the full attention of the greatest demonologists, and through them the various lords, tyrants, autarchs and heirophants who depended on sorcery to buttress their mundane power. So great was his deception that all his summoners considered themselves the master and Shadow Demon the servant; meanwhile, he eroded their identities and made their minds his own. In the end, most members of the cult were hollow puppets, extensions of his evil will. What Shadow Demon's next step would have been remains open to speculation, for around this time, Nevermore the Shadow Fiend bit into a particularly nasty-tasting soul and discovered that it held nothing but a foul nougat of Shadow Demon's essence. Alerted that a coup was underway, and that the ancient equilibrium of the Umbral Pact was about to be destabilized, Doom Bringer and Shadow Fiend briefly joined forces to destroy the burgeoning cult. Combining spells of incredible force, they undid Shadow Demon's centuries of patient work, reducing his cult to smithereens--and all its members to a bloody splatter. Nothing remained except a tiny speck of demon shadow. Immortal and irreducible, this mote of evil was enough to seed the Shadow Demon's next scheme, and in fits and starts, over further centuries, he began to regroup. Whatever that speck of shadow touched, it tainted, and its influence gradually grew. A chaos of damaged parts pulled together, reknit, and combined to give Shadow Demon a form even stronger than his former. He is all but complete now, and his plan for infinite dominion lacks all of its former weaknesses. It would seem that such a being of pure malice and malevolence, a threat to all creation, would be forever out of place in our world...yet Shadow Demon does not lack for followers."}