{"skills": [{"skilldesc": "Shadow Fiend razes the area in front of him, dealing damage to enemy units in an area.", "skillname": "Shadowraze", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/nevermore_shadowraze1_hp1.png"}, {"skilldesc": "Shadow Fiend steals the soul from units he kills, gaining bonus damage. If the killed unit is a hero, he gains 12 souls.  On death, he releases half of them from bondage.", "skillname": "Necromastery", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/nevermore_necromastery_hp1.png"}, {"skilldesc": "Shadow Fiend's presence reduces the armor of nearby enemies.", "skillname": "Presence of the Dark Lord", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/nevermore_dark_lord_hp1.png"}, {"skilldesc": "Captured souls are used to deal massive damage, as well as slowing and reducing the attack damage of nearby enemy units. Requiem of Souls creates one wave of damage for every 2 souls stored by Necromastery.  The closest enemy units are hit the hardest.  Requiem of Souls has a 1.67 second cast time before it is activated.  Requiem of Souls is automatically cast when Shadow Fiend dies, independent of its cooldown.", "skillname": "Requiem of Souls", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/nevermore_requiem_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/nevermore_full.png", "name": "Shadow Fiend", "desc": "It is said that Nevermore the Shadow Fiend has the soul of a poet, and in fact he has thousands of them. Over the ages he has claimed the souls of poets, priests, emperors, beggars, slaves, philosophers, criminals and (naturally) heroes; no sort of soul escapes him. What he does with them is unknown. No one has ever peered into the Abysm whence Nevermore reaches out like an eel from among astral rocks. Does he devour them one after another? Does he mount them along the halls of an eldritch temple, or pickle the souls in necromantic brine? Is he merely a puppet, pushed through the dimensional rift by a demonic puppeteer? Such is his evil, so intense his aura of darkness, that no rational mind may penetrate it. Of course, if you really want to know where the stolen souls go, there's one sure way to find out: Add your soul to his collection. Or just wait for Nevermore."}