{"skills": [{"skilldesc": "Fires a ball of shrapnel that showers the target area in explosive pellets. Enemies are subject to damage and slowed movement. Reveals the targeted area.", "skillname": "Shrapnel", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sniper_shrapnel_hp1.png"}, {"skilldesc": "Sniper increases his accuracy, giving a chance to deal extra damage and mini-stun. Headshot procs cannot be evaded.", "skillname": "Headshot", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sniper_headshot_hp1.png"}, {"skilldesc": "Extends the attack range of Sniper's rifle.", "skillname": "Take Aim", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sniper_take_aim_hp1.png"}, {"skilldesc": "Sniper locks onto a target enemy unit, and after 1.7 seconds, fires a devastating shot that deals damage at long range, and mini-stuns the target.", "skillname": "Assassinate", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/sniper_assassinate_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/sniper_full.png", "name": "Sniper", "desc": "Kardel Sharpeye was born deep in the mountains of Knollen where, since time immemorial, Keen Folk have survived by hunting the strange, cliff-dwelling steepstalkers above their village, shooting them from a distance and collecting the carcasses where they fell. Sharpeye was among the best of these strange mountain keens for whom projectile weapons are but another appendage, and to shoot is as natural as to touch.  On his day of summoning, when he was to gain full standing in his village, Sharpeye took the ancient test: a single shot from the valley floor to strike a beast down from the cliffs. To miss was to be dishonored. With his entire village standing vigil, Sharpeye took his shot. A steepstalker fell; the crowd cheered.  But when the carcass was collected, the village grew silent, for the elders found that the bullet had pierced its glittering central eye then fallen to be clenched in the steepstalker's mandibles. This ominous sign was the literal opening of a dark prophecy, foretelling both greatness and exile for the gunman who made such a shot. Sharpeye the Sniper was thus, by his own skill, condemned to make his way apart from his people-and unwelcome back among them until he has fulfilled the remainder of the prophecy by attaining legendary stature on a field of battle."}