{"skills": [{"skilldesc": "Spectre flings a dagger to draw a Shadow Path, dealing damage and slowing the movement speed of any enemies along the trail. Units hit by the dagger also trail a Shadow Path. While treading the path, Spectre phases through otherwise impassable terrain.", "skillname": "Spectral Dagger", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spectre_spectral_dagger_hp1.png"}, {"skilldesc": "Deals bonus pure damage when Spectre attacks an enemy hero who is alone.", "skillname": "Desolate", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spectre_desolate_hp1.png"}, {"skilldesc": "Damage done to Spectre is reflected on her enemies, leaving her unharmed. The effect lessens with distance.", "skillname": "Dispersion", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spectre_dispersion_hp1.png"}, {"skilldesc": "Spectre physically possesses a chosen Haunt.", "skillname": "Reality", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spectre_reality_hp1.png"}, {"skilldesc": "Creates a spectral nemesis to attack each enemy hero after a short delay. At any moment during the duration, Spectre can use Reality to take the place of a given illusion.\n\nHaunt illusions are uncontrollable, take extra damage, and deal less damage than Spectre herself.  They move at 400 base movement speed and ignore terrain.", "skillname": "Haunt", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spectre_haunt_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/spectre_full.png", "name": "Spectre", "desc": "Just as higher states of energy seek a lower level, the Spectre known as Mercurial is a being of intense and violent energy who finds herself irresistibly drawn to scenes of strife as they unfold in the physical world. While her normal spectral state transcends sensory limitations, each time she takes on a physical manifestation, she is stricken by a loss of self--though not of purpose. In the clash of combat, her identity shatters and reconfigures, and she begins to regain awareness. She grasps that she is Mercurial the Spectre--and that all of her Haunts are but shadows of the one true Spectre. Focus comes in the struggle for survival; her true mind reasserts itself; until in the final moments of victory or defeat, she transcends matter and is restored once more to her eternal form."}