{"skills": [{"skilldesc": "Spirit Breaker fixes his sight on an enemy unit and starts charging through all objects.  All enemy units passed through and the targeted unit will be hit by a Greater Bash.  If the targeted unit dies, Spirit Breaker will change his target to the nearest enemy unit to that location.", "skillname": "Charge of Darkness", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_charge_of_darkness_hp1.png"}, {"skilldesc": "Causes the Spirit Breaker to gain power with higher movement speed. His presence increases the movement speed of nearby allied units.", "skillname": "Empowering Haste", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_empowering_haste_hp1.png"}, {"skilldesc": "Gives a chance to stun and knockback an enemy unit on an attack, as well as gaining bonus movement speed after a bash occurs. Deals a percentage of movement speed as damage.", "skillname": "Greater Bash", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_greater_bash_hp1.png"}, {"skilldesc": "Spirit Breaker slips into the nether realm, reappearing next to his hapless victim. Upon reappearing, a Greater Bash of the current level occurs and deals bonus damage.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Nether Strike", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_nether_strike_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/spirit_breaker_full.png", "name": "Spirit Breaker", "desc": "Barathrum the Spirit Breaker is a lordly and powerful being, a fierce and elemental intelligence which chose to plane-shift into the world of matter to take part in events with repercussions in the elemental realm that is his home. To that end, he assembled a form that would serve him well, both in our world and out of it. His physical form borrows from the strengths of this world, blending features both bovine and simian--horns, hooves and hands-as outward emblems of his inner qualities of strength, speed and cunning. He wears a ring in his nose, as a reminder that he serves a hidden master, and that this world in which he works is but a shadow of the real one."}