{"skills": [{"skilldesc": "Fires an intense energy beam, dealing damage and blinding the target for 3 seconds, causing it to miss all physical attacks. Its range is doubled with Aghanim's Scepter.", "skillname": "Laser", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/tinker_laser_hp1.png"}, {"skilldesc": "Launches a pair of rockets at the nearest visible enemy heroes within 2500 range. The number of missile targets is doubled with Aghanim's Scepter.", "skillname": "Heat-Seeking Missile", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/tinker_heat_seeking_missile_hp1.png"}, {"skilldesc": "Enlists an army of robotic minions to destroy enemy units in an area around Tinker.", "skillname": "March of the Machines", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/tinker_march_of_the_machines_hp1.png"}, {"skilldesc": "CHANNELED - Resets the cooldown on most of Tinker's items and abilities.", "skillname": "Rearm", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/tinker_rearm_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/tinker_full.png", "name": "Tinker", "desc": "Boush the Tinker's diminutive race is known for its intelligence, its cunning, and its prickly relationship with magic. As a matter of pride, they survive by their wits, and use only those powers of nature that may be unlocked through rational methodologies. Even this forbearance has led to a great deal of trouble, as Boush can attest. Once a key investigator of natural law, Boush the Tinker led a vast intellectual investigation into the workings of nature, founding a subterranean laboratory in the rumored, mist-wreathed wastes of the Violet Plateau. While scorning mages for the dangers they visit upon the world, Boush and his Tinker associates haughtily wrenched open a portal to some realm beyond comprehension and ushered in some nightmares of their own. A black mist rose from the cavernous interior of the Violet Plateau, shrouding it in permanent darkness from which sounds of horror perpetually emanate. Boush escaped with only his wits and the contraptions he carried, the sole Tinker to survive the Violet Plateau Incident."}