{"skills": [{"skilldesc": "Allows the Warlord to use his throwing axes as melee weapons, gaining bonus damage, attack speed, movement speed, hitpoints, armor, and a chance to bash targets on attack.  Berserker's Rage also changes the functionality of Whirling Axes.", "skillname": "Berserker's Rage", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/troll_warlord_berserkers_rage_hp1.png"}, {"skilldesc": "Troll hurls a fistful of five axes in a cone shape over 900 range, slowing and damaging enemy units.", "skillname": "Whirling Axes (Ranged)", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/troll_warlord_whirling_axes_ranged_hp1.png"}, {"skilldesc": "Troll hurls two axes around him in a close range area of effect, damaging enemy units and causing them to miss some attacks.", "skillname": "Whirling Axes (Melee)", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/troll_warlord_whirling_axes_melee_hp1.png"}, {"skilldesc": "With each continuous blow on the same target, Troll gains increased attack speed.  If Troll changes targets, the stacks drop to zero.", "skillname": "Fervor", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/troll_warlord_fervor_hp1.png"}, {"skilldesc": "Troll's presence on the battlefield increases the attack speed of himself and all allied heroes. ", "skillname": "Battle Trance", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/troll_warlord_battle_trance_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/troll_warlord_full.png", "name": "Troll Warlord", "desc": "It's an easy thing to offend a troll. A prickly and contentious race, trolls thrive on argument and strife, missing no excuse to raise their voices in dispute. Males grow to maturity in subterranean chambers beneath their matriarch's domicile, feeding and amusing themselves while contributing nothing. Often they stay for years beyond the age of maturity, while the matriarch provides them with sustenance. When young trolls are finally pushed from their sub-chamber, they gather with others of their kind, forming roving gangs of malcontents who complain loudly about all manner of vexation.      As much as trolls love to argue, imagine how rare it is for a troll to be driven from his own kind for being too difficult to get along with. Such was Jah'rakal's fate, a monger troll from deep in the Hoven. So deluded was he, so bitter and abrasive, that even other trolls found his company intolerable. After one particularly vitriolic outburst in which he claimed the lion's share of loot from their latest raid, his cohorts finally snapped. They turned on him, beat him with clubs, and drove him from the encampment. Enraged at his banishment, he returned the next day, armed with steel, and slew them all, one by one. He then swore a blood oath: he would ever after be a fighting force unto himself. Now he roams the world as the Troll Warlord, bitter and angry, the Imperial high commander of an army of one."}