{"skills": [{"skilldesc": "Fires a magic missile at an enemy unit, stunning and dealing damage.", "skillname": "Magic Missile", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/vengefulspirit_magic_missile_hp1.png"}, {"skilldesc": "Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path.", "skillname": "Wave of Terror", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/vengefulspirit_wave_of_terror_hp1.png"}, {"skilldesc": "Vengeful Spirit's presence increases nearby friendly units' physical damage. If Vengeful Spirit is slain, her killer will be possessed with a negative Vengeance Aura, reducing the damage of her killer and its nearby allies until Vengeful Spirit revives.", "skillname": "Vengeance Aura", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/vengefulspirit_command_aura_hp1.png"}, {"skilldesc": "Instantaneously swaps positions with a target Hero, friend or enemy.  Nether Swap interrupts channeling abilities on the target.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Nether Swap", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/vengefulspirit_nether_swap_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/vengefulspirit_full.png", "name": "Vengeful Spirit", "desc": "Even the most contented Skywrath is an ill-tempered creature, naturally inclined to seek revenge for the slightest insult. But Vengeful Spirit is the essence of vengeance. Once a proud and savage Skywrath scion, Shendelzare was first in succession for the Ghastly Eyrie until a sister's treachery robbed her of her birthright. Snared in an assassin's net, Shendelzare tore free only at the cost of her wings, limping away in the ultimate humiliation: On foot. With her wings broken, she knew the Skywrath would never accept her as ruler; and in the highest roost of the Eyrie, inaccessible except by winged flight, her sister was untouchable. Unwilling to live as a flightless cripple, and desiring revenge far more than earthly power, the fallen princess drove a bargain with the goddess Scree'auk: She surrendered her broken body for an imperishable form of spirit energy, driven by vengeance, capable of doing great damage in the material plane. She may spend eternity flightless, but she will have her revenge."}