{"skills": [{"skilldesc": "Binds several enemy units together, causing 20% of the damage dealt to one of them to be felt by the others.", "skillname": "Fatal Bonds", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/warlock_fatal_bonds_hp1.png"}, {"skilldesc": "Demnok whispers an incantation, healing a friendly unit or damaging an enemy unit over time.", "skillname": "Shadow Word", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/warlock_shadow_word_hp1.png"}, {"skilldesc": "CHANNELED - A powerful slowing current that grows stronger as it's channelled. Lasts up to 16 seconds, slowing enemies up to 84%.  Enemies are slowed for 3 seconds after leaving the area or the spell ends.", "skillname": "Upheaval", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/warlock_upheaval_hp1.png"}, {"skilldesc": "Summons a Golem from the depths, stunning enemies for one second. The Golem lives 60 seconds, takes reduced damage from spells, has Permanent Immolation and Flaming Fists on attack.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Chaotic Offering", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/warlock_rain_of_chaos_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/warlock_full.png", "name": "Warlock", "desc": "As Chief Curator and Head of Acquisitions for the Arcane Archives of the Ultimyr Academy, Demnok Lannik was tireless in his pursuit of lost, rare and forbidden tomes. No cursed temple was so foreboding, no cavern path so treacherous, that any concern for his own survival could dissuade him from entering if rumors hinted that some pamphlet of primordial lore might still survive in its depths. However, so often did his investigations trigger the wrath of protector entities, that he finally found it necessary to master the arts of magic. He bent himself to learning sorcery with the same thorough obsessiveness that marked his quest for incunabula, becoming the most powerful Warlock of the Academy in less time than most practitioners required to complete a course of undergraduate work. Almost as an afterthought, he carved a staff of Dreadwood and summoned into it a captive spirit from the Outer Hells. And anticipating the day when he will have recovered every last lost spellbook, he has commenced writing his own Black Grimoire. It will undoubtedly be instructive."}