{"skills": [{"skilldesc": "Shackles the target to an enemy unit or tree in a line directly behind it.  If no unit or tree is present, the stun duration is reduced to 0.75.", "skillname": "Shackleshot", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/windrunner_shackleshot_hp1.png"}, {"skilldesc": "Windranger charges her bow for up to 1 second for a single powerful shot. The arrow deals damage to enemy units and destroys trees in its path. Damage is greatest on first target, and reduces by 10% for each target it pierces thereafter.  If the channeling is cancelled early, the shot will still occur but deal less damage.", "skillname": "Powershot", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/windrunner_powershot_hp1.png"}, {"skilldesc": "Increases movement speed and adds evasion from all physical attacks, while slowing movement of nearby enemies.", "skillname": "Windrun", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/windrunner_windrun_hp1.png"}, {"skilldesc": "Windranger channels the wind, gaining maximum attack speed on the enemy unit or structure, although with reduced damage, including damage from Unique Attack Modifiers and item effects.  Lasts 20 seconds.\n\nUpgradable with Aghanim's Scepter.", "skillname": "Focus Fire", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/windrunner_focusfire_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/windrunner_full.png", "name": "Windranger", "desc": "The western forests guard their secrets well. One of these is Lyralei, master archer of the wood, and favored godchild of the wind.  Known now as Windranger, Lyralei's family was killed in a storm on the night of her birth--their house blown down by the gale, contents scattered to the winds. Only the newborn survived among the debris field of death and destruction.  In the quiet after the storm, the wind itself took notice of the lucky infant crying in the grass. The wind pitied the child and so lifted her into the sky and deposited her on a doorstep in a neighboring village.  In the years that followed, the wind returned occasionally to the child's life, watching from a distance while she honed her skills.  Now, after many years of training, Windranger fires her arrows true to their targets.  She moves with blinding speed, as if hastened by a wind ever at her back.  With a flurry of arrows, she slaughters her enemies, having become, nearly, a force of nature herself."}