{"skills": [{"skilldesc": "Hurls a bolt of lightning that leaps through nearby enemy units.", "skillname": "Arc Lightning", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/zuus_arc_lightning_hp1.png"}, {"skilldesc": "Calls down a bolt of lightning to strike an enemy unit, causing damage and a mini-stun. When cast, Lightning Bolt briefly provides unobstructed vision and True Sight around the target in a 750 radius. Can be cast on the ground, affecting the closest enemy hero in 250 range.", "skillname": "Lightning Bolt", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/zuus_lightning_bolt_hp1.png"}, {"skilldesc": "Zeus shocks all nearby enemy units whenever he casts a spell, causing damage proportional to their current health.", "skillname": "Static Field", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/zuus_static_field_hp1.png"}, {"skilldesc": "Strikes all enemy heroes with a bolt of lightning, no matter where they may be.  Thundergod's Wrath also provides True Sight around each hero struck.  If an enemy hero is invisible, it takes no damage, but the True Sight is still created at that hero's location.\n\nUpgradable by Aghanim's Scepter.", "skillname": "Thundergod's Wrath", "picurl": "http://cdn.dota2.com/apps/dota2/images/abilities/zuus_thundergods_wrath_hp1.png"}], "picture": "http://cdn.dota2.com/apps/dota2/images/heroes/zuus_full.png", "name": "Zeus", "desc": "Lord of Heaven, father of gods, Zeus treats all the Heroes as if they are his rambunctious, rebellious children. After being caught unnumbered times in the midst of trysts with countless mortal women, his divine wife finally gave him an ultimatum: 'If you love mortals so much, go and become one. If you can prove yourself faithful, then return to me as my immortal husband. Otherwise, go and die among your creatures.' Zeus found her logic (and her magic) irrefutable, and agreed to her plan. He has been on his best behavior ever since, being somewhat fonder of immortality than he is of mortals. But to prove himself worthy of his eternal spouse, he must continue to pursue victory on the field of battle."}